## Лабораторная работа №9.

---

Так как я выбрал писать не на Python, а на Go, буду указывать на места ошибок в этом документе, и впоследствии писать правильный, покрытый тестами код на Go.

Что-ж, я -28 номер по списку, беру задачи 4, 14.

---

- __Задание 4.__
  Требовалось написать программу, которая получает на вход натуральное число N, не превосходящее 10^9, и выводит число, равное количеству цифр 4 в десятичной записи числа N. Программист написал программу неправильно..
    __Код:__
    ```python
    N = int(input())
    R = 0
    while N > 0:
        d = N % 10
        if d != 4:
                R = R + d
          N = N // 10
    print(R)
    ```
    Текущая оценка ошибки:
      - В данном случае, ошибка присутствует в строке `R = R + d`, здесь реализована логика суммирования последней цифры с результатом, если она не равна 4.
    Решение:
      - Изменить программу, чтобы она работала подобающим ТЗ образом.
    Результат:

        ```go
            === RUN   TestSolveModule
                === RUN   TestSolveModule/positive_module
                    --- PASS: TestSolveModule/positive_module (0.00s)
                === RUN   TestSolveModule/negative_module
                    --- PASS: TestSolveModule/negative_module (0.00s)
                --- PASS: TestSolveModule (0.00s)
            PASS
            ok      lr9/task_4/solution     (cached)
        ```

---

- __Задание 14.__
     В натуральном числе N (0 < N < 109) необходимо подсчитать количество цифр десятичной записи, чётность которых совпадает с чётностью последней цифры числа N. Например, для N = 123 должен получиться ответ 2 (последняя цифра числа нечётная, а всего в записи числа две нечётные цифры: 1 и 3). Для решения этой задачи ученик написал программу, но, к сожалению, его программа неправильная.
     __Код:__
     ```python
    N = int(input())
    k = 0
    d = N % 10
    while N > 0:
        if N % 2 == d:
            k += d
        N = N // 10
    print(k)
    ```
    Текущая оценка ошибки:
        - В данном случаем, ошибка присутствует в строке `if N % 2 == d`, программист не учёл условие правильно, и проверяет последнее число не на чётность, а на совпадение последнего числа с остатком от деления
    Решение:
        - Изменить программу, чтобы она работала подобающим ТЗ образом.
    Результат:

        ```go
        === RUN   TestSolveModule
            === RUN   TestSolveModule/positive_module
                --- PASS: TestSolveModule/positive_module (0.00s)
            === RUN   TestSolveModule/negative_module
                --- PASS: TestSolveModule/negative_module (0.00s)
            --- PASS: TestSolveModule (0.00s)
        PASS
        ok      lr9/task_14/solution    0.001s
        ```